# SetSelectionRange

## Description
Sets the range of the current selection for the specified control.

```pascal
PROCEDURE SetSelectionRange(
				dialogID  : LONGINT;
				controlID : LONGINT;
				startPos  : INTEGER;
				endPos    : INTEGER);
```

```python
def vs.SetSelectionRange(dialogID, controlID, startPos, endPos):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|controlID|LONGINT|   |
|startPos|INTEGER|   |
|endPos|INTEGER|   |

## Version
Availability: from VectorWorks12.0.1

## Category
* Dialogs - Modern